{
  "cards": [
    {
      "number": 0,
      "name": "The Fool",
      "meaning": "New beginnings, innocence, spontaneity, and a free spirit. The Fool represents the start of a journey and taking a leap of faith."
    },
    {
      "number": 1,
      "name": "The Magician",
      "meaning": "Manifestation, resourcefulness, and inspired action. The Magician represents your ability to utilize all your skills and resources to achieve your goals."
    },
    {
      "number": 2,
      "name": "The High Priestess",
      "meaning": "Intuition, mystery, and inner knowledge. The High Priestess represents the connection to your subconscious mind and spiritual awareness."
    },
    {
      "number": 3,
      "name": "The Empress",
      "meaning": "Abundance, nurturing, and fertility. The Empress represents creation, growth, and the nurturing of ideas or relationships."
    },
    {
      "number": 4,
      "name": "The Emperor",
      "meaning": "Authority, structure, and leadership. The Emperor represents power, stability, and the establishment of order."
    },
    {
      "number": 5,
      "name": "The Hierophant",
      "meaning": "Tradition, conformity, and spiritual guidance. The Hierophant represents conventional wisdom and established beliefs."
    },
    {
      "number": 6,
      "name": "The Lovers",
      "meaning": "Relationships, choices, and harmony. The Lovers represents important decisions, partnerships, and alignment of values."
    },
    {
      "number": 7,
      "name": "The Chariot",
      "meaning": "Determination, willpower, and success. The Chariot represents overcoming obstacles through confidence and control."
    },
    {
      "number": 8,
      "name": "Strength",
      "meaning": "Inner strength, patience, and gentle control. Strength represents courage, compassion, and mastery of emotions."
    },
    {
      "number": 9,
      "name": "The Hermit",
      "meaning": "Introspection, solitude, and inner guidance. The Hermit represents self-reflection and the search for inner truth."
    },
    {
      "number": 10,
      "name": "Wheel of Fortune",
      "meaning": "Change, cycles, and destiny. The Wheel of Fortune represents life's ups and downs and the nature of fate."
    },
    {
      "number": 11,
      "name": "Justice",
      "meaning": "Fairness, truth, and cause and effect. Justice represents balance, karma, and making objective decisions."
    },
    {
      "number": 12,
      "name": "The Hanged Man",
      "meaning": "Surrender, letting go, and new perspectives. The Hanged Man represents sacrifice and seeing things differently."
    },
    {
      "number": 13,
      "name": "Death",
      "meaning": "Endings, transformation, and renewal. Death represents major changes and the end of one phase leading to new beginnings."
    },
    {
      "number": 14,
      "name": "Temperance",
      "meaning": "Balance, moderation, and patience. Temperance represents harmony, finding middle ground, and self-control."
    },
    {
      "number": 15,
      "name": "The Devil",
      "meaning": "Bondage, materialism, and shadow self. The Devil represents attachments, limitations, and confronting our darker nature."
    },
    {
      "number": 16,
      "name": "The Tower",
      "meaning": "Sudden change, upheaval, and revelation. The Tower represents breakthrough moments and the collapse of false structures."
    },
    {
      "number": 17,
      "name": "The Star",
      "meaning": "Hope, inspiration, and serenity. The Star represents renewal of faith and finding guidance in dark times."
    },
    {
      "number": 18,
      "name": "The Moon",
      "meaning": "Illusion, intuition, and the subconscious. The Moon represents uncertainty, dreams, and hidden truths."
    },
    {
      "number": 19,
      "name": "The Sun",
      "meaning": "Joy, success, and positivity. The Sun represents clarity, warmth, and achievement of goals."
    },
    {
      "number": 20,
      "name": "Judgement",
      "meaning": "Rebirth, inner calling, and absolution. Judgement represents awakening, self-evaluation, and answering a higher call."
    },
    {
      "number": 21,
      "name": "The World",
      "meaning": "Completion, integration, and accomplishment. The World represents fulfillment, harmony, and the end of a cycle."
    }
  ]
}
